## Handling the Date Time Scenario

In [1]:

import numpy as np
import pandas as pd

In [2]:
date = pd.read_csv("E:\Python and ML\Dataset\orders.csv")

<>:1: SyntaxWarning: invalid escape sequence '\P'
<>:1: SyntaxWarning: invalid escape sequence '\P'
C:\Users\HP\AppData\Local\Temp\ipykernel_7068\561168019.py:1: SyntaxWarning: invalid escape sequence '\P'
  date = pd.read_csv("E:\Python and ML\Dataset\orders.csv")

In [3]:
time = pd.read_csv("E:\Python and ML\Dataset\messages.csv")

<>:1: SyntaxWarning: invalid escape sequence '\P'
<>:1: SyntaxWarning: invalid escape sequence '\P'
C:\Users\HP\AppData\Local\Temp\ipykernel_7068\2330487331.py:1: SyntaxWarning: invalid escape sequence '\P'
  time = pd.read_csv("E:\Python and ML\Dataset\messages.csv")

In [4]:
date.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [5]:
time.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [6]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [7]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

### Working with Dates

In [8]:
# converting to datetime datatype

date["date"] = pd.to_datetime(date["date"])

In [9]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

### 1. Extract year

In [10]:
date["date_year"] = date["date"].dt.year
date.sample(5)

          date  product_id  city_id  orders  date_year
125 2019-03-13        5874        9       5       2019
746 2019-02-01        6632       22       5       2019
951 2018-08-02        2238       22       5       2018
428 2018-07-14        4183       22       8       2018
76  2019-04-18        5973       16       1       2019

### 2. Extract Month

In [11]:
date["date_month_no"] = date["date"].dt.month
date.head()

        date  product_id  city_id  orders  date_year  date_month_no
0 2019-12-10        5628       25       3       2019             12
1 2018-08-15        3646       14     157       2018              8
2 2018-10-23        1859       25       1       2018             10
3 2019-08-17        7292       25       1       2019              8
4 2019-01-06        4344       25       3       2019              1

In [12]:
date["date_month_name"] = date["date"].dt.month_name()
date.head()

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name
0,2019-12-10,5628,25,3,2019,12,December
1,2018-08-15,3646,14,157,2018,8,August
2,2018-10-23,1859,25,1,2018,10,October
3,2019-08-17,7292,25,1,2019,8,August
4,2019-01-06,4344,25,3,2019,1,January

In [13]:
date.head()

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name
0,2019-12-10,5628,25,3,2019,12,December
1,2018-08-15,3646,14,157,2018,8,August
2,2018-10-23,1859,25,1,2018,10,October
3,2019-08-17,7292,25,1,2019,8,August
4,2019-01-06,4344,25,3,2019,1,January

### 3. Extract Days

In [14]:
date["date_day"] = date["date"].dt.day
date.head()

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name,date_day
0,2019-12-10,5628,25,3,2019,12,December,10
1,2018-08-15,3646,14,157,2018,8,August,15
2,2018-10-23,1859,25,1,2018,10,October,23
3,2019-08-17,7292,25,1,2019,8,August,17
4,2019-01-06,4344,25,3,2019,1,January,6

In [15]:
# day of the week
date["date_dow"] = date["date"].dt.dayofweek
date.head()

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name,date_day,date_dow
0,2019-12-10,5628,25,3,2019,12,December,10,1
1,2018-08-15,3646,14,157,2018,8,August,15,2
2,2018-10-23,1859,25,1,2018,10,October,23,1
3,2019-08-17,7292,25,1,2019,8,August,17,5
4,2019-01-06,4344,25,3,2019,1,January,6,6

In [16]:
# day of week - name

date["date_dow_name"] = date["date"].dt.day_name()
date.head()

,date,product_id,city_id,orders,date_year,date_month_no,date_month_name,date_day,date_dow,date_dow_name
0,2019-12-10,5628,25,3,2019,12,December,10,1,Tuesday
1,2018-08-15,3646,14,157,2018,8,August,15,2,Wednesday
2,2018-10-23,1859,25,1,2018,10,October,23,1,Tuesday
3,2019-08-17,7292,25,1,2019,8,August,17,5,Saturday
4,2019-01-06,4344,25,3,2019,1,January,6,6,Sunday

In [17]:
date.drop(columns =["product_id","city_id","orders"], inplace = True)

In [18]:
date.head()

,date,date_year,date_month_no,date_month_name,date_day,date_dow,date_dow_name
0,2019-12-10,2019,12,December,10,1,Tuesday
1,2018-08-15,2018,8,August,15,2,Wednesday
2,2018-10-23,2018,10,October,23,1,Tuesday
3,2019-08-17,2019,8,August,17,5,Saturday
4,2019-01-06,2019,1,January,6,6,Sunday

In [19]:
# is weekend?
date["date_is_weekend"] = np.where(date["date_dow_name"].isin(["Saturday","Sunday"]),1,0)
date.head()

,date,date_year,date_month_no,date_month_name,date_day,date_dow,date_dow_name,date_is_weekend
0,2019-12-10,2019,12,December,10,1,Tuesday,0
1,2018-08-15,2018,8,August,15,2,Wednesday,0
2,2018-10-23,2018,10,October,23,1,Tuesday,0
3,2019-08-17,2019,8,August,17,5,Saturday,1
4,2019-01-06,2019,1,January,6,6,Sunday,1

### 4. Extract week of the year

In [20]:
date["date_week"] = date["date"].dt.weekday
date.head()

,date,date_year,date_month_no,date_month_name,date_day,date_dow,date_dow_name,date_is_weekend,date_week
0,2019-12-10,2019,12,December,10,1,Tuesday,0,1
1,2018-08-15,2018,8,August,15,2,Wednesday,0,2
2,2018-10-23,2018,10,October,23,1,Tuesday,0,1
3,2019-08-17,2019,8,August,17,5,Saturday,1,5
4,2019-01-06,2019,1,January,6,6,Sunday,1,6

### 5.Extract Quarter

In [21]:
date["quarter"] = date["date"].dt.quarter
date.head()

,date,date_year,date_month_no,date_month_name,date_day,date_dow,date_dow_name,date_is_weekend,date_week,quarter
0,2019-12-10,2019,12,December,10,1,Tuesday,0,1,4
1,2018-08-15,2018,8,August,15,2,Wednesday,0,2,3
2,2018-10-23,2018,10,October,23,1,Tuesday,0,1,4
3,2019-08-17,2019,8,August,17,5,Saturday,1,5,3
4,2019-01-06,2019,1,January,6,6,Sunday,1,6,1

### 6. Extract Semester

In [22]:
date["semester"] = np.where(date["quarter"].isin([1,2]),1,2)
date.head()

,date,date_year,date_month_no,date_month_name,date_day,date_dow,date_dow_name,date_is_weekend,date_week,quarter,semester
0,2019-12-10,2019,12,December,10,1,Tuesday,0,1,4,2
1,2018-08-15,2018,8,August,15,2,Wednesday,0,2,3,2
2,2018-10-23,2018,10,October,23,1,Tuesday,0,1,4,2
3,2019-08-17,2019,8,August,17,5,Saturday,1,5,3,2
4,2019-01-06,2019,1,January,6,6,Sunday,1,6,1,1

### 7. Extract Time elapsed between dates

In [23]:
import datetime

In [24]:
today = datetime.datetime.today()
today

datetime.datetime(2025, 9, 30, 11, 38, 35, 11181)

In [25]:
today - date["date"]

0     2121 days 11:38:35.011181
1     2603 days 11:38:35.011181
2     2534 days 11:38:35.011181
3     2236 days 11:38:35.011181
4     2459 days 11:38:35.011181
                 ...
995   2549 days 11:38:35.011181
996   2490 days 11:38:35.011181
997   2338 days 11:38:35.011181
998   2403 days 11:38:35.011181
999   2177 days 11:38:35.011181
Name: date, Length: 1000, dtype: timedelta64[ns]

In [26]:
(today - date["date"]).dt.days

0      2121
1      2603
2      2534
3      2236
4      2459
       ...
995    2549
996    2490
997    2338
998    2403
999    2177
Name: date, Length: 1000, dtype: int64

In [32]:
# Months passed

np.round((today - date["date"])/np.timedelta64(1,'m'),0)

0      3054939.0
1      3749019.0
2      3649659.0
3      3220539.0
4      3541659.0
         ...
995    3671259.0
996    3586299.0
997    3367419.0
998    3461019.0
999    3135579.0
Name: date, Length: 1000, dtype: float64

In [33]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [34]:
# converting to datetime datatype
time["date"] = pd.to_datetime(time["date"])

In [35]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

In [36]:
time['hour'] = time['date'].dt.hour
time['min'] = time['date'].dt.minute
time['sec'] = time['date'].dt.second

time.head()

,date,msg,hour,min,sec
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0

### Extract the time part

In [39]:
time["time"] = time["date"].dt.time
time.head()

,date,msg,hour,min,sec,time
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0,00:50:00
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0,23:40:00
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0,00:21:00
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0,00:31:00
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0,23:11:00

### Time difference

In [40]:
today - time["date"]

0     4307 days 10:48:35.011181
1     4171 days 11:58:35.011181
2     4657 days 11:17:35.011181
3     3959 days 11:07:35.011181
4     4356 days 12:27:35.011181
                 ...
995   4946 days 10:48:35.011181
996   4267 days 12:24:35.011181
997   4732 days 12:01:35.011181
998   4848 days 12:04:35.011181
999   4120 days 12:13:35.011181
Name: date, Length: 1000, dtype: timedelta64[ns]

In [ ]:
# in seconds

(today - time["date"])/np.timedelta64(1,'s')

0      3.721637e+08
1      3.604175e+08
2      4.024055e+08
3      3.420977e+08
4      3.764033e+08
           ...
995    4.273733e+08
996    3.687135e+08
997    4.088881e+08
998    4.189107e+08
999    3.560120e+08
Name: date, Length: 1000, dtype: float64

In [42]:
# in minutes

(today - time["date"])/np.timedelta64(1,'m')

0      6.202729e+06
1      6.006959e+06
2      6.706758e+06
3      5.701628e+06
4      6.273388e+06
           ...
995    7.122889e+06
996    6.145225e+06
997    6.814802e+06
998    6.981845e+06
999    5.933534e+06
Name: date, Length: 1000, dtype: float64

In [43]:
# in hours

(today - time['date'])/np.timedelta64(1,'h')

0      103378.809725
1      100115.976392
2      111779.293059
3       95027.126392
4      104556.459725
           ...
995    118714.809725
996    102420.409725
997    113580.026392
998    116364.076392
999     98892.226392
Name: date, Length: 1000, dtype: float64